cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    // BLOCK 1
    (0    0    0) //  0
    (500  0    0) //  1
    (500  100  0) //  2
    (0    100  0) //  3
    (0    0    1) //  4
    (500  0    1) //  5
    (500  100  1) //  6
    (0    100  1) //  7

    // BLOCK 2
    (500  0    0) //  8
    (600  0    0) //  9
    (600  100  0) // 10
    (500  100  0) // 11
    (500  0    1) // 12
    (600  0    1) // 13
    (600  100  1) // 14
    (500  100  1) // 15
    
    // BLOCK 3
    (600  0    0) // 16
    (700  0    0) // 17
    (700  100  0) // 18
    (600  100  0) // 19
    (600  0    1) // 20
    (700  0    1) // 21
    (700  100  1) // 22
    (600  100  1) // 23
    
    // BLOCK 4
    (700  0    0) // 24
    (800  0    0) // 25
    (800  100  0) // 26
    (700  100  0) // 27
    (700  0    1) // 28
    (800  0    1) // 29
    (800  100  1) // 30
    (700  100  1) // 31
    
    // BLOCK 5
    (800  0    0) // 32
    (1300 0    0) // 33
    (1300 100  0) // 34
    (800  100  0) // 35
    (800  0    1) // 36
    (1300 0    1) // 37
    (1300 100  1) // 38
    (800  100  1) // 39
    
    // BLOCK 6
    (0    100  0) // 40
    (500  100  0) // 41
    (500  600  0) // 42
    (0    600  0) // 43
    (0    100  1) // 44
    (500  100  1) // 45
    (500  600  1) // 46
    (0    600  1) // 47
    
    // BLOCK 7
    (500  100  0) // 48
    (600  100  0) // 49
    (600  600  0) // 50
    (500  600  0) // 51
    (500  100  1) // 52
    (600  100  1) // 53
    (600  600  1) // 54
    (500  600  1) // 55
    
    // BLOCK 8
    (600  100  0) // 56
    (700  100  0) // 57
    (700  600  0) // 58
    (600  600  0) // 59
    (600  100  1) // 60
    (700  100  1) // 61
    (700  600  1) // 62
    (600  600  1) // 63
    
    // BLOCK 9
    (700  100  0) // 64
    (800  100  0) // 65
    (800  600  0) // 66
    (700  600  0) // 67
    (700  100  1) // 68
    (800  100  1) // 69
    (800  600  1) // 70
    (700  600  1) // 71
    
    // BLOCK 10
    (700  100  0) // 72
    (800  100  0) // 73
    (800  600  0) // 74
    (700  600  0) // 75
    (700  100  1) // 76
    (800  100  1) // 77
    (800  600  1) // 78
    (700  600  1) // 79
    
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) (20 20 1) simpleGrading (1 1 1)
    hex ( 8  9 10 11 12 13 14 15) (20 20 1) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (20 20 1) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31) (20 20 1) simpleGrading (1 1 1)
    hex (32 33 34 35 36 37 38 39) (20 20 1) simpleGrading (1 1 1)
    hex (40 41 42 43 44 45 46 47) (20 20 1) simpleGrading (1 1 1)
    hex (48 49 50 51 52 53 54 55) (20 20 1) simpleGrading (1 1 1)
    hex (56 57 58 59 60 61 62 63) (20 20 1) simpleGrading (1 1 1)
    hex (64 65 66 67 68 69 70 71) (20 20 1) simpleGrading (1 1 1)
    hex (72 73 74 75 76 77 78 79) (20 20 1) simpleGrading (1 1 1)
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
